Last login: Tue Apr  6 11:39:50 on ttys000
complete:13: command not found: compdef
rock@MacBookX ~ % cd Desktop 
rock@MacBookX Desktop % ls
Binding death benefit nomination for super members.pdf
CobaltStrike
Scamwebsite.mov
Spending
TestVM
beneficiaries1.pdf
rock@MacBookX Desktop % git clone https://github.com/clong/DetectionLab.git
Cloning into 'DetectionLab'...
remote: Enumerating objects: 4608, done.
remote: Total 4608 (delta 0), reused 0 (delta 0), pack-reused 4608
Receiving objects: 100% (4608/4608), 193.07 MiB | 5.63 MiB/s, done.
Resolving deltas: 100% (2722/2722), done.
rock@MacBookX Desktop % cd DetectionLab   
rock@MacBookX DetectionLab % s
zsh: command not found: s
rock@MacBookX DetectionLab % ls
AWS		CONTRIBUTING.md	LICENSE		Vagrant
Azure		ESXi		Packer		ci
Boxes		HyperV		README.md	img
rock@MacBookX DetectionLab % cp DetectionLab/AWS/Terraform/terraform.tfvars.example /DetectionLab/AWS/Terraform/terraform.tfvars
cp: DetectionLab/AWS/Terraform/terraform.tfvars.example: No such file or directory
rock@MacBookX DetectionLab % cd ..
rock@MacBookX Desktop % cp DetectionLab/AWS/Terraform/terraform.tfvars.example /DetectionLab/AWS/Terraform/terraform.tfvars
cp: /DetectionLab/AWS/Terraform/terraform.tfvars: No such file or directory
rock@MacBookX Desktop % cp DetectionLab/AWS/Terraform/terraform.tfvars.example /Users/rock/Desktop/DetectionLab/AWS/Terraform/terraform.tfvars         
rock@MacBookX Desktop % ls
Binding death benefit nomination for super members.pdf
CobaltStrike
DetectionLab
Scamwebsite.mov
Spending
TestVM
beneficiaries1.pdf
rock@MacBookX Desktop % clear

rock@MacBookX Desktop % cd DetectionLab                                        
rock@MacBookX DetectionLab % cd AWS 
rock@MacBookX AWS % cd Terraform 
rock@MacBookX Terraform % ls
Pre-Built_AMIs.md		terraform.tfvars
README.md			terraform.tfvars.example
VM_to_AMIs.md			variables.tf
locals.tf			versions.tf
main.tf				vm_import
outputs.tf
rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear












rock@MacBookX Terraform % ssh-keygen -b 2048 -f ~/.ssh/id_logger
Generating public/private rsa key pair.
Enter passphrase (empty for no passphrase): 
Enter same passphrase again: 
Your identification has been saved in /Users/rock/.ssh/id_logger.
Your public key has been saved in /Users/rock/.ssh/id_logger.pub.
The key fingerprint is:
SHA256:v6ilK83pgxjJYA3Q6KR06y9lGdXEmiixjk6THa4mfqo rock@MacBookX.local
The key's randomart image is:
+---[RSA 2048]----+
|oo      +.       |
|.+.o   . o       |
|= + + o o        |
|oo * o o         |
|.oB.o o S        |
| =+= +   .       |
|o oo++ .. .      |
|.+.oo.=o . .     |
|Eoo .o=+. .      |
+----[SHA256]-----+
rock@MacBookX Terraform % clear



rock@MacBookX Terraform % nano terraform.tfvars                 
rock@MacBookX Terraform % pbpaste > terraform.tfvars
rock@MacBookX Terraform % clear





















rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % aws ec2 describe-subnet

usage: aws [options] <command> <subcommand> [<subcommand> ...] [parameters]
To see help text, you can run:

  aws help
  aws <command> help
  aws <command> <subcommand> help

aws: error: argument operation: Invalid choice, valid choices are:

accept-reserved-instances-exchange-quote | accept-transit-gateway-multicast-domain-associations
accept-transit-gateway-peering-attachment | accept-transit-gateway-vpc-attachment   
accept-vpc-endpoint-connections          | accept-vpc-peering-connection           
advertise-byoip-cidr                     | allocate-address                        
allocate-hosts                           | apply-security-groups-to-client-vpn-target-network
assign-ipv6-addresses                    | assign-private-ip-addresses             
associate-address                        | associate-client-vpn-target-network     
associate-dhcp-options                   | associate-enclave-certificate-iam-role  
associate-iam-instance-profile           | associate-route-table                   
associate-subnet-cidr-block              | associate-transit-gateway-multicast-domain
associate-transit-gateway-route-table    | associate-vpc-cidr-block                
attach-classic-link-vpc                  | attach-internet-gateway                 
attach-network-interface                 | attach-volume                           
attach-vpn-gateway                       | authorize-client-vpn-ingress            
authorize-security-group-egress          | authorize-security-group-ingress        
bundle-instance                          | cancel-bundle-task                      
cancel-capacity-reservation              | cancel-conversion-task                  
cancel-export-task                       | cancel-import-task                      
cancel-reserved-instances-listing        | cancel-spot-fleet-requests              
cancel-spot-instance-requests            | confirm-product-instance                
copy-fpga-image                          | copy-image                              
copy-snapshot                            | create-capacity-reservation             
create-carrier-gateway                   | create-client-vpn-endpoint              
create-client-vpn-route                  | create-customer-gateway                 
create-default-subnet                    | create-default-vpc                      
create-dhcp-options                      | create-egress-only-internet-gateway     
create-fleet                             | create-flow-logs                        
create-fpga-image                        | create-image                            
create-instance-export-task              | create-internet-gateway                 
create-key-pair                          | create-launch-template                  
create-launch-template-version           | create-local-gateway-route              
create-local-gateway-route-table-vpc-association | create-managed-prefix-list              
create-nat-gateway                       | create-network-acl                      
create-network-acl-entry                 | create-network-insights-path            
create-network-interface                 | create-network-interface-permission     
create-placement-group                   | create-replace-root-volume-task         
create-reserved-instances-listing        | create-route                            
create-route-table                       | create-security-group                   
create-snapshot                          | create-snapshots                        
create-spot-datafeed-subscription        | create-subnet                           
create-tags                              | create-traffic-mirror-filter            
create-traffic-mirror-filter-rule        | create-traffic-mirror-session           
create-traffic-mirror-target             | create-transit-gateway                  
create-transit-gateway-connect           | create-transit-gateway-connect-peer     
create-transit-gateway-multicast-domain  | create-transit-gateway-peering-attachment
create-transit-gateway-prefix-list-reference | create-transit-gateway-route            
create-transit-gateway-route-table       | create-transit-gateway-vpc-attachment   
create-volume                            | create-vpc                              
create-vpc-endpoint                      | create-vpc-endpoint-connection-notification
create-vpc-endpoint-service-configuration | create-vpc-peering-connection           
create-vpn-connection                    | create-vpn-connection-route             
create-vpn-gateway                       | delete-carrier-gateway                  
delete-client-vpn-endpoint               | delete-client-vpn-route                 
delete-customer-gateway                  | delete-dhcp-options                     
delete-egress-only-internet-gateway      | delete-fleets                           
delete-flow-logs                         | delete-fpga-image                       
delete-internet-gateway                  | delete-key-pair                         
delete-launch-template                   | delete-launch-template-versions         
delete-local-gateway-route               | delete-local-gateway-route-table-vpc-association
delete-managed-prefix-list               | delete-nat-gateway                      
delete-network-acl                       | delete-network-acl-entry                
delete-network-insights-analysis         | delete-network-insights-path            
delete-network-interface                 | delete-network-interface-permission     
delete-placement-group                   | delete-queued-reserved-instances        
delete-route                             | delete-route-table                      
delete-security-group                    | delete-snapshot                         
delete-spot-datafeed-subscription        | delete-subnet                           
delete-tags                              | delete-traffic-mirror-filter            
delete-traffic-mirror-filter-rule        | delete-traffic-mirror-session           
delete-traffic-mirror-target             | delete-transit-gateway                  
delete-transit-gateway-connect           | delete-transit-gateway-connect-peer     
delete-transit-gateway-multicast-domain  | delete-transit-gateway-peering-attachment
delete-transit-gateway-prefix-list-reference | delete-transit-gateway-route            
delete-transit-gateway-route-table       | delete-transit-gateway-vpc-attachment   
delete-volume                            | delete-vpc                              
delete-vpc-endpoint-connection-notifications | delete-vpc-endpoint-service-configurations
delete-vpc-endpoints                     | delete-vpc-peering-connection           
delete-vpn-connection                    | delete-vpn-connection-route             
delete-vpn-gateway                       | deprovision-byoip-cidr                  
deregister-image                         | deregister-instance-event-notification-attributes
deregister-transit-gateway-multicast-group-members | deregister-transit-gateway-multicast-group-sources
describe-account-attributes              | describe-addresses                      
describe-addresses-attribute             | describe-aggregate-id-format            
describe-availability-zones              | describe-bundle-tasks                   
describe-byoip-cidrs                     | describe-capacity-reservations          
describe-carrier-gateways                | describe-classic-link-instances         
describe-client-vpn-authorization-rules  | describe-client-vpn-connections         
describe-client-vpn-endpoints            | describe-client-vpn-routes              
describe-client-vpn-target-networks      | describe-coip-pools                     
describe-conversion-tasks                | describe-customer-gateways              
describe-dhcp-options                    | describe-egress-only-internet-gateways  
describe-elastic-gpus                    | describe-export-image-tasks             
describe-export-tasks                    | describe-fast-snapshot-restores         
describe-fleet-history                   | describe-fleet-instances                
describe-fleets                          | describe-flow-logs                      
describe-fpga-image-attribute            | describe-fpga-images                    
describe-host-reservation-offerings      | describe-host-reservations              
describe-hosts                           | describe-iam-instance-profile-associations
describe-id-format                       | describe-identity-id-format             
describe-image-attribute                 | describe-images                         
describe-import-image-tasks              | describe-import-snapshot-tasks          
describe-instance-attribute              | describe-instance-credit-specifications 
describe-instance-event-notification-attributes | describe-instance-status                
describe-instance-type-offerings         | describe-instance-types                 
describe-instances                       | describe-internet-gateways              
describe-ipv6-pools                      | describe-key-pairs                      
describe-launch-template-versions        | describe-launch-templates               
describe-local-gateway-route-table-virtual-interface-group-associations | describe-local-gateway-route-table-vpc-associations
describe-local-gateway-route-tables      | describe-local-gateway-virtual-interface-groups
describe-local-gateway-virtual-interfaces | describe-local-gateways                 
describe-managed-prefix-lists            | describe-moving-addresses               
describe-nat-gateways                    | describe-network-acls                   
describe-network-insights-analyses       | describe-network-insights-paths         
describe-network-interface-attribute     | describe-network-interface-permissions  
describe-network-interfaces              | describe-placement-groups               
describe-prefix-lists                    | describe-principal-id-format            
describe-public-ipv4-pools               | describe-regions                        
describe-replace-root-volume-tasks       | describe-reserved-instances             
describe-reserved-instances-listings     | describe-reserved-instances-modifications
describe-reserved-instances-offerings    | describe-route-tables                   
describe-scheduled-instance-availability | describe-scheduled-instances            
describe-security-group-references       | describe-security-groups                
describe-snapshot-attribute              | describe-snapshots                      
describe-spot-datafeed-subscription      | describe-spot-fleet-instances           
describe-spot-fleet-request-history      | describe-spot-fleet-requests            
describe-spot-instance-requests          | describe-spot-price-history             
describe-stale-security-groups           | describe-subnets                        
describe-tags                            | describe-traffic-mirror-filters         
describe-traffic-mirror-sessions         | describe-traffic-mirror-targets         
describe-transit-gateway-attachments     | describe-transit-gateway-connect-peers  
describe-transit-gateway-connects        | describe-transit-gateway-multicast-domains
describe-transit-gateway-peering-attachments | describe-transit-gateway-route-tables   
describe-transit-gateway-vpc-attachments | describe-transit-gateways               
describe-volume-attribute                | describe-volume-status                  
describe-volumes                         | describe-volumes-modifications          
describe-vpc-attribute                   | describe-vpc-classic-link               
describe-vpc-classic-link-dns-support    | describe-vpc-endpoint-connection-notifications
describe-vpc-endpoint-connections        | describe-vpc-endpoint-service-configurations
describe-vpc-endpoint-service-permissions | describe-vpc-endpoint-services          
describe-vpc-endpoints                   | describe-vpc-peering-connections        
describe-vpcs                            | describe-vpn-connections                
describe-vpn-gateways                    | detach-classic-link-vpc                 
detach-internet-gateway                  | detach-network-interface                
detach-volume                            | detach-vpn-gateway                      
disable-ebs-encryption-by-default        | disable-fast-snapshot-restores          
disable-serial-console-access            | disable-transit-gateway-route-table-propagation
disable-vgw-route-propagation            | disable-vpc-classic-link                
disable-vpc-classic-link-dns-support     | disassociate-address                    
disassociate-client-vpn-target-network   | disassociate-enclave-certificate-iam-role
disassociate-iam-instance-profile        | disassociate-route-table                
disassociate-subnet-cidr-block           | disassociate-transit-gateway-multicast-domain
disassociate-transit-gateway-route-table | disassociate-vpc-cidr-block             
enable-ebs-encryption-by-default         | enable-fast-snapshot-restores           
enable-serial-console-access             | enable-transit-gateway-route-table-propagation
enable-vgw-route-propagation             | enable-volume-io                        
enable-vpc-classic-link                  | enable-vpc-classic-link-dns-support     
export-client-vpn-client-certificate-revocation-list | export-client-vpn-client-configuration  
export-image                             | export-transit-gateway-routes           
get-associated-enclave-certificate-iam-roles | get-associated-ipv6-pool-cidrs          
get-capacity-reservation-usage           | get-coip-pool-usage                     
get-console-output                       | get-console-screenshot                  
get-default-credit-specification         | get-ebs-default-kms-key-id              
get-ebs-encryption-by-default            | get-groups-for-capacity-reservation     
get-host-reservation-purchase-preview    | get-launch-template-data                
get-managed-prefix-list-associations     | get-managed-prefix-list-entries         
get-password-data                        | get-reserved-instances-exchange-quote   
get-serial-console-access-status         | get-transit-gateway-attachment-propagations
get-transit-gateway-multicast-domain-associations | get-transit-gateway-prefix-list-references
get-transit-gateway-route-table-associations | get-transit-gateway-route-table-propagations
import-client-vpn-client-certificate-revocation-list | import-image                            
import-key-pair                          | import-snapshot                         
modify-address-attribute                 | modify-availability-zone-group          
modify-capacity-reservation              | modify-client-vpn-endpoint              
modify-default-credit-specification      | modify-ebs-default-kms-key-id           
modify-fleet                             | modify-fpga-image-attribute             
modify-hosts                             | modify-id-format                        
modify-identity-id-format                | modify-image-attribute                  
modify-instance-attribute                | modify-instance-capacity-reservation-attributes
modify-instance-credit-specification     | modify-instance-event-start-time        
modify-instance-metadata-options         | modify-instance-placement               
modify-launch-template                   | modify-managed-prefix-list              
modify-network-interface-attribute       | modify-reserved-instances               
modify-snapshot-attribute                | modify-spot-fleet-request               
modify-subnet-attribute                  | modify-traffic-mirror-filter-network-services
modify-traffic-mirror-filter-rule        | modify-traffic-mirror-session           
modify-transit-gateway                   | modify-transit-gateway-prefix-list-reference
modify-transit-gateway-vpc-attachment    | modify-volume                           
modify-volume-attribute                  | modify-vpc-attribute                    
modify-vpc-endpoint                      | modify-vpc-endpoint-connection-notification
modify-vpc-endpoint-service-configuration | modify-vpc-endpoint-service-permissions 
modify-vpc-peering-connection-options    | modify-vpc-tenancy                      
modify-vpn-connection                    | modify-vpn-connection-options           
modify-vpn-tunnel-certificate            | modify-vpn-tunnel-options               
monitor-instances                        | move-address-to-vpc                     
provision-byoip-cidr                     | purchase-host-reservation               
purchase-reserved-instances-offering     | purchase-scheduled-instances            
reboot-instances                         | register-image                          
register-instance-event-notification-attributes | register-transit-gateway-multicast-group-members
register-transit-gateway-multicast-group-sources | reject-transit-gateway-multicast-domain-associations
reject-transit-gateway-peering-attachment | reject-transit-gateway-vpc-attachment   
reject-vpc-endpoint-connections          | reject-vpc-peering-connection           
release-address                          | release-hosts                           
replace-iam-instance-profile-association | replace-network-acl-association         
replace-network-acl-entry                | replace-route                           
replace-route-table-association          | replace-transit-gateway-route           
report-instance-status                   | request-spot-fleet                      
request-spot-instances                   | reset-address-attribute                 
reset-ebs-default-kms-key-id             | reset-fpga-image-attribute              
reset-image-attribute                    | reset-instance-attribute                
reset-network-interface-attribute        | reset-snapshot-attribute                
restore-address-to-classic               | restore-managed-prefix-list-version     
revoke-client-vpn-ingress                | revoke-security-group-egress            
revoke-security-group-ingress            | run-instances                           
run-scheduled-instances                  | search-local-gateway-routes             
search-transit-gateway-multicast-groups  | search-transit-gateway-routes           
send-diagnostic-interrupt                | start-instances                         
start-network-insights-analysis          | start-vpc-endpoint-service-private-dns-verification
stop-instances                           | terminate-client-vpn-connections        
terminate-instances                      | unassign-ipv6-addresses                 
unassign-private-ip-addresses            | unmonitor-instances                     
update-security-group-rule-descriptions-egress | update-security-group-rule-descriptions-ingress
withdraw-byoip-cidr                      | wait                                    
help                                    


Invalid choice: 'describe-subnet', maybe you meant:

  * describe-subnets

rock@MacBookX Terraform % aws ec2 describe-subnets
{
    "Subnets": [
        {
            "AvailabilityZone": "us-west-2d",
            "AvailabilityZoneId": "usw2-az4",
            "AvailableIpAddressCount": 4091,
            "CidrBlock": "172.31.48.0/20",
            "DefaultForAz": true,
            "MapPublicIpOnLaunch": true,
            "MapCustomerOwnedIpOnLaunch": false,
            "State": "available",
            "SubnetId": "subnet-017b7025632010325",
            "VpcId": "vpc-0931792a4573a569d",
            "OwnerId": "208157287953",
            "AssignIpv6AddressOnCreation": false,
            "Ipv6CidrBlockAssociationSet": [],
            "SubnetArn": "arn:aws:ec2:us-west-2:208157287953:subnet/subnet-017b7025632010325"
        },
        {
            "AvailabilityZone": "us-west-2c",
            "AvailabilityZoneId": "usw2-az3",
            "AvailableIpAddressCount": 4091,
            "CidrBlock": "172.31.0.0/20",
            "DefaultForAz": true,
            "MapPublicIpOnLaunch": true,
            "MapCustomerOwnedIpOnLaunch": false,
            "State": "available",
            "SubnetId": "subnet-04617630a24c36b26",
            "VpcId": "vpc-0931792a4573a569d",
            "OwnerId": "208157287953",
            "AssignIpv6AddressOnCreation": false,
            "Ipv6CidrBlockAssociationSet": [],
            "SubnetArn": "arn:aws:ec2:us-west-2:208157287953:subnet/subnet-04617630a24c36b26"
        },
        {
            "AvailabilityZone": "us-west-2b",
            "AvailabilityZoneId": "usw2-az2",
            "AvailableIpAddressCount": 4091,
            "CidrBlock": "172.31.32.0/20",
            "DefaultForAz": true,
            "MapPublicIpOnLaunch": true,
            "MapCustomerOwnedIpOnLaunch": false,
            "State": "available",
            "SubnetId": "subnet-0f72e4d0894fd0bdd",
            "VpcId": "vpc-0931792a4573a569d",
            "OwnerId": "208157287953",
            "AssignIpv6AddressOnCreation": false,
            "Ipv6CidrBlockAssociationSet": [],
            "SubnetArn": "arn:aws:ec2:us-west-2:208157287953:subnet/subnet-0f72e:
rock@MacBookX Terraform % lear
zsh: command not found: lear
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear






















rock@MacBookX Terraform % cat terraform.tfvars
region = "us-west-2"
profile = "terraform"
shared_credentials_file = "/Users/rock/.aws/credentials"
public_key_name = "id_logger"
public_key_path = "/Users/rock/.ssh/id_logger.pub"
private_key_path = "/Users/rock/.ssh/id_logger"
ip_whitelist = ["24.156.99.202/32"]
availability_zone = "us-west-1b"
rock@MacBookX Terraform % terraform ini
Usage: terraform [global options] <subcommand> [args]

The available commands for execution are listed below.
The primary workflow commands are given first, followed by
less common or more advanced commands.

Main commands:
  init          Prepare your working directory for other commands
  validate      Check whether the configuration is valid
  plan          Show changes required by the current configuration
  apply         Create or update infrastructure
  destroy       Destroy previously-created infrastructure

All other commands:
  console       Try Terraform expressions at an interactive command prompt
  fmt           Reformat your configuration in the standard style
  force-unlock  Release a stuck lock on the current workspace
  get           Install or upgrade remote Terraform modules
  graph         Generate a Graphviz graph of the steps in an operation
  import        Associate existing infrastructure with a Terraform resource
  login         Obtain and save credentials for a remote host
  logout        Remove locally-stored credentials for a remote host
  output        Show output values from your root module
  providers     Show the providers required for this configuration
  refresh       Update the state to match remote systems
  show          Show the current state or a saved plan
  state         Advanced state management
  taint         Mark a resource instance as not fully functional
  untaint       Remove the 'tainted' state from a resource instance
  version       Show the current Terraform version
  workspace     Workspace management

Global options (use these before the subcommand, if any):
  -chdir=DIR    Switch to a different working directory before executing the
                given subcommand.
  -help         Show this help output, or the help for a specified subcommand.
  -version      An alias for the "version" subcommand.
rock@MacBookX Terraform % terraform init

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v3.35.0...
- Installed hashicorp/aws v3.35.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX Terraform % terraform validate
Success! The configuration is valid.

rock@MacBookX Terraform % cat outputs.tf 
output "region" {
  value = var.region
}

output "logger_public_ip" {
  value = aws_instance.logger.public_ip
}

output "dc_public_ip" {
  value = aws_instance.dc.public_ip
}

output "wef_public_ip" {
  value = aws_instance.wef.public_ip
}

output "win10_public_ip" {
  value = aws_instance.win10.public_ip
}

output "ata_url" {
  value = local.ata_url
}

output "fleet_url" {
  value = local.fleet_url
}

output "splunk_url" {
  value = local.splunk_url
}

output "guacamole_url" {
  value = local.guacamole_url
}

output "velociraptor_url" {
  value = local.velociraptor_url
}
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % terraform apply

Error: error configuring Terraform AWS Provider: error validating provider credentials: error calling sts:GetCallerIdentity: InvalidClientTokenId: The security token included in the request is invalid.
        status code: 403, request id: 54819935-6d07-4bc0-be2c-51523b041842

  on main.tf line 2, in provider "aws":
   2: provider "aws" {


rock@MacBookX Terraform % aws configure
AWS Access Key ID [****************EW5G]: AKIATA5ZEEYI76XGEW5G
AWS Secret Access Key [****************5ky3]: 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
Default region name [us-west-2]: 
Default output format [json]: 
rock@MacBookX Terraform % aws ec2 describe-vpcs
{
    "Vpcs": [
        {
            "CidrBlock": "172.31.0.0/16",
            "DhcpOptionsId": "dopt-08572279038e2aec2",
            "State": "available",
            "VpcId": "vpc-0931792a4573a569d",
            "OwnerId": "208157287953",
            "InstanceTenancy": "default",
            "CidrBlockAssociationSet": [
                {
                    "AssociationId": "vpc-cidr-assoc-01b0e0bd9c27965e0",
                    "CidrBlock": "172.31.0.0/16",
                    "CidrBlockState": {
                        "State": "associated"
                    }
                }
            ],
            "IsDefault": true
        }
    ]
}
rock@MacBookX Terraform % cd ..
rock@MacBookX AWS % ls
Terraform
rock@MacBookX AWS % cd ..
rock@MacBookX DetectionLab % cd ..
rock@MacBookX Desktop % ls 
Binding death benefit nomination for super members.pdf
CobaltStrike
DetectionLab
Scamwebsite.mov
Spending
TestVM
beneficiaries1.pdf
rock@MacBookX Desktop % cd TestVM 
rock@MacBookX TestVM % ls
--group-name                    output.tf
--policy-arn                    terraform.tfstate
--user-name                     terraform.tfstate.backup
main.tf
rock@MacBookX TestVM % terraform init

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.34.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX TestVM % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.example will be created
  + resource "aws_instance" "example" {
      + ami                          = "ami-830c94e3"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "ExampleInstance"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id        = (known after apply)
  + instance_public_ip = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_instance.example: Creating...
aws_instance.example: Still creating... [10s elapsed]
aws_instance.example: Still creating... [20s elapsed]
aws_instance.example: Still creating... [30s elapsed]
aws_instance.example: Creation complete after 30s [id=i-04829ea1cd9dea0d9]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

instance_id = "i-04829ea1cd9dea0d9"
instance_public_ip = "52.43.12.34"
rock@MacBookX TestVM % ssh cloud_user@52.43/12/34
ssh: Could not resolve hostname 52.43/12/34: nodename nor servname provided, or not known
rock@MacBookX TestVM % ssh cloud_user@           
^C
rock@MacBookX TestVM % ssh cloud_user@52.43.12.34                             
^C
rock@MacBookX TestVM % ssh cloud_user@52.43.12.34
^C
rock@MacBookX TestVM % clear

rock@MacBookX TestVM % ssh -i "id_rsa" ubuntu@ec2-52-43-12-34.us-west-2.compute.amazonaws.com
Warning: Identity file id_rsa not accessible: No such file or directory.
^C
rock@MacBookX TestVM % ssh  ubuntu@ec2-52-43-12-34.us-west-2.compute.amazonaws.com         
^C
rock@MacBookX TestVM % terraform destroy

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # aws_instance.example will be destroyed
  - resource "aws_instance" "example" {
      - ami                          = "ami-830c94e3" -> null
      - arn                          = "arn:aws:ec2:us-west-2:208157287953:instance/i-04829ea1cd9dea0d9" -> null
      - associate_public_ip_address  = true -> null
      - availability_zone            = "us-west-2c" -> null
      - cpu_core_count               = 1 -> null
      - cpu_threads_per_core         = 1 -> null
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - get_password_data            = false -> null
      - hibernation                  = false -> null
      - id                           = "i-04829ea1cd9dea0d9" -> null
      - instance_state               = "running" -> null
      - instance_type                = "t2.micro" -> null
      - ipv6_address_count           = 0 -> null
      - ipv6_addresses               = [] -> null
      - monitoring                   = false -> null
      - primary_network_interface_id = "eni-026d28e3041d56d4a" -> null
      - private_dns                  = "ip-172-31-11-231.us-west-2.compute.internal" -> null
      - private_ip                   = "172.31.11.231" -> null
      - public_dns                   = "ec2-52-43-12-34.us-west-2.compute.amazonaws.com" -> null
      - public_ip                    = "52.43.12.34" -> null
      - secondary_private_ips        = [] -> null
      - security_groups              = [
          - "default",
        ] -> null
      - source_dest_check            = true -> null
      - subnet_id                    = "subnet-04617630a24c36b26" -> null
      - tags                         = {
          - "Name" = "ExampleInstance"
        } -> null
      - tenancy                      = "default" -> null
      - vpc_security_group_ids       = [
          - "sg-0736cf7bf3a68da08",
        ] -> null

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08844b8c3490a3a1d" -> null
          - volume_size           = 8 -> null
          - volume_type           = "standard" -> null
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - instance_id        = "i-04829ea1cd9dea0d9" -> null
  - instance_public_ip = "52.43.12.34" -> null

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

aws_instance.example: Destroying... [id=i-04829ea1cd9dea0d9]
cd
aws_instance.example: Still destroying... [id=i-04829ea1cd9dea0d9, 10s elapsed]
aws_instance.example: Still destroying... [id=i-04829ea1cd9dea0d9, 20s elapsed]
aws_instance.example: Still destroying... [id=i-04829ea1cd9dea0d9, 30s elapsed]
aws_instance.example: Destruction complete after 34s

Destroy complete! Resources: 1 destroyed.
rock@MacBookX TestVM % cd
rock@MacBookX ~ % cd ..
rock@MacBookX /Users % cd   
rock@MacBookX ~ % ls 
Applications                    Movies
CV1                             Music
Desktop                         Pictures
Documents                       Public
Downloads                       Virtual Machines.localized
Library                         eLearning
rock@MacBookX ~ % Cd Desktop 
rock@MacBookX ~ % cd Desktop 
rock@MacBookX Desktop % ls   
Binding death benefit nomination for super members.pdf
CobaltStrike
DetectionLab
Scamwebsite.mov
Spending
TestVM
beneficiaries1.pdf
rock@MacBookX Desktop % cd DetectionLab 
rock@MacBookX DetectionLab % cd AWS/Terraform 
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % cat terraform.tfvars
region = "us-west-2"
profile = "terraform"
shared_credentials_file = "/Users/rock/.aws/credentials"
public_key_name = "id_logger"
public_key_path = "/Users/rock/.ssh/id_logger.pub"
private_key_path = "/Users/rock/.ssh/id_logger"
ip_whitelist = ["24.156.99.202/32"]
availability_zone = "us-west-1b"
rock@MacBookX Terraform % terraform init

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.35.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX Terraform % terraform plan

Error: error configuring Terraform AWS Provider: error validating provider credentials: error calling sts:GetCallerIdentity: InvalidClientTokenId: The security token included in the request is invalid.
        status code: 403, request id: 19760b1e-2ea6-4680-8e71-be67bd6f184d

  on main.tf line 2, in provider "aws":
   2: provider "aws" {


rock@MacBookX Terraform % cleaer
zsh: command not found: cleaer
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % terraform plan -var-file terraform.tfvars

Error: error configuring Terraform AWS Provider: error validating provider credentials: error calling sts:GetCallerIdentity: InvalidClientTokenId: The security token included in the request is invalid.
        status code: 403, request id: 954045f7-4ad6-4590-bfdd-fed3f7a60c10

  on main.tf line 2, in provider "aws":
   2: provider "aws" {


rock@MacBookX Terraform % clear












rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear






















rock@MacBookX Terraform % cat terraform.tfvars
region = "us-west-2"
shared_credentials_file = "/Users/rock/.aws/credentials"
public_key_name = "id_logger"
public_key_path = "/Users/rock/.ssh/id_logger.pub"
private_key_path = "/Users/rock/.ssh/id_logger"
ip_whitelist = ["24.156.99.202/32"]
availability_zone = "us-west-1b"
rock@MacBookX Terraform % terraform init 

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.35.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX Terraform % terraform plan

Error: error configuring Terraform AWS Provider: no valid credential sources for Terraform AWS Provider found.

Please see https://registry.terraform.io/providers/hashicorp/aws
for more information about providing credentials.

Error: NoCredentialProviders: no valid providers in chain. Deprecated.
        For verbose messaging see aws.Config.CredentialsChainVerboseErrors


  on main.tf line 2, in provider "aws":
   2: provider "aws" {


rock@MacBookX Terraform % clear

rock@MacBookX Terraform % aws configure 
AWS Access Key ID [None]: AKIATA5ZEEYI76XGEW5G
AWS Secret Access Key [None]: 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
Default region name [None]: us-west-2
Default output format [None]: json
rock@MacBookX Terraform % aws ec2 describe-vpcs
{
    "Vpcs": [
        {
            "CidrBlock": "172.31.0.0/16",
            "DhcpOptionsId": "dopt-08572279038e2aec2",
            "State": "available",
            "VpcId": "vpc-0931792a4573a569d",
            "OwnerId": "208157287953",
            "InstanceTenancy": "default",
            "CidrBlockAssociationSet": [
                {
                    "AssociationId": "vpc-cidr-assoc-01b0e0bd9c27965e0",
                    "CidrBlock": "172.31.0.0/16",
                    "CidrBlockState": {
                        "State": "associated"
                    }
                }
            ],
            "IsDefault": true
        }
    ]
}
rock@MacBookX Terraform % terraform init

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.35.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX Terraform % terraform plan

Error: error configuring Terraform AWS Provider: no valid credential sources for Terraform AWS Provider found.

Please see https://registry.terraform.io/providers/hashicorp/aws
for more information about providing credentials.

Error: NoCredentialProviders: no valid providers in chain. Deprecated.
        For verbose messaging see aws.Config.CredentialsChainVerboseErrors


  on main.tf line 2, in provider "aws":
   2: provider "aws" {


rock@MacBookX Terraform % aws configure --profile terraform
AWS Access Key ID [None]: AKIATA5ZEEYI76XGEW5G
AWS Secret Access Key [None]: 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
Default region name [None]: us-west-2
Default output format [None]: json
rock@MacBookX Terraform % terraform plan                   

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % cp DetectionLab/AWS/Terraform/terraform.tfvars.example /Users/rock/Desktop/DetectionLab/AWS/Terraform/terraform.tfvars

cp: DetectionLab/AWS/Terraform/terraform.tfvars.example: No such file or directory
rock@MacBookX Terraform % cp /Users/rock/Desktop/DetectionLab/AWS/Terraform/terraform.tfvars.example /Users/rock/Desktop/DetectionLab/AWS/TerCraform/terraform.tfvars

cp: /Users/rock/Desktop/DetectionLab/AWS/TerCraform/terraform.tfvars: No such file or directory
rock@MacBookX Terraform % cp /Users/rock/Desktop/DetectionLab/AWS/Terraform/terraform.tfvars.example /Users/rock/Desktop/DetectionLab/AWS/TerCraform/terraform.tfvars

cp: /Users/rock/Desktop/DetectionLab/AWS/TerCraform/terraform.tfvars: No such file or directory
rock@MacBookX Terraform % cd ..
rock@MacBookX AWS % cd..
zsh: command not found: cd..
rock@MacBookX AWS % cd ..
rock@MacBookX DetectionLab % cd ..
rock@MacBookX Desktop % cp DetectionLab/AWS/Terraform/terraform.tfvars.example /Users/rock/Desktop/DetectionLab/AWS/Terraform/terraform.tfvars

rock@MacBookX Desktop % cd DetectionLab 
rock@MacBookX DetectionLab % clear

rock@MacBookX DetectionLab % pwd
/Users/rock/Desktop/DetectionLab
rock@MacBookX DetectionLab % cd AWS 
rock@MacBookX AWS % cd Terraform 
rock@MacBookX Terraform % clear



















rock@MacBookX Terraform % cat terraform.tfvars
region = "us-west-1"
profile = "terraform"
shared_credentials_file = "/home/user/.aws/credentials"
public_key_name = "id_logger"
public_key_path = "/home/user/.ssh/id_logger.pub"
private_key_path = "/home/user/.ssh/id_logger"
ip_whitelist = ["1.2.3.4/32"]
availability_zone = "us-west-1b"
// instance_name_prefix = "some_prefix_"
// custom-tags = {"tag_name": "tag_value"}
rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear











rock@MacBookX Terraform % cp /Users/rock/.aws/credentials 
usage: cp [-R [-H | -L | -P]] [-fi | -n] [-apvXc] source_file target_file
       cp [-R [-H | -L | -P]] [-fi | -n] [-apvXc] source_file ... target_directory
rock@MacBookX Terraform % clear



















rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % terraform plan

Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 3d07729f-8411-4893-87f0-c0afead07c73

  on variables.tf line 61, in data "aws_ami" "logger_ami":
  61: data "aws_ami" "logger_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 83057294-d5eb-4f99-b8bc-91a520e25d77

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 0b339b26-7f2f-41cf-9966-4f8644b07d98

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 413b40ea-2c6e-4339-bae7-060e5252b9e2

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % terraform plan       

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % clear

rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear






















rock@MacBookX Terraform % terraform plan       

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % clear

rock@MacBookX Terraform % terraform plan       

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % terraform plan

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % 






























rock@MacBookX Terraform %  lear
zsh: command not found: lear
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % terraform plan

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % clear

rock@MacBookX Terraform % aws configure
AWS Access Key ID [****************EW5G]: 
AWS Secret Access Key [****************5ky3]: 
Default region name [us-west-2]: us-west-1
Default output format [json]: 
rock@MacBookX Terraform % terraform plan

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % aws configure set region us-west-1
rock@MacBookX Terraform % terraform plan                    

Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: Your query returned no results. Please change your search criteria and try again.

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % clear

rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % terraform plan       

Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 70aaed8d-172e-4cb8-95a4-698203f6ebf9

  on variables.tf line 61, in data "aws_ami" "logger_ami":
  61: data "aws_ami" "logger_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: e8c7120d-4094-42db-8eb8-0ee6bb7d391a

  on variables.tf line 71, in data "aws_ami" "dc_ami":
  71: data "aws_ami" "dc_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 3d572292-dd20-4d73-abdf-3172ca0aeb43

  on variables.tf line 81, in data "aws_ami" "wef_ami":
  81: data "aws_ami" "wef_ami" {



Error: UnauthorizedOperation: You are not authorized to perform this operation.
        status code: 403, request id: 785ab26b-9ca2-4650-837b-76cfdf2bac89

  on variables.tf line 104, in data "aws_ami" "win10_ami":
 104: data "aws_ami" "win10_ami" {


rock@MacBookX Terraform % nano terraform.tfvars
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % aws ec2 describe-images --owners 505638924199 | grep -i imageid

An error occurred (UnauthorizedOperation) when calling the DescribeImages operation: You are not authorized to perform this operation.
rock@MacBookX Terraform % aws ec2 describe-images --owners 505638924199 | grep -i imageid

An error occurred (UnauthorizedOperation) when calling the DescribeImages operation: You are not authorized to perform this operation.
rock@MacBookX Terraform % clear













rock@MacBookX Terraform % aws configure --profile terraform
AWS Access Key ID [None]: AKIATCXWQ5VA7EC3PZL2
AWS Secret Access Key [None]: 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
Default region name [None]: us-west-1
Default output format [None]: json
rock@MacBookX Terraform % aws configure set region us-west-1
rock@MacBookX Terraform % aws ec2 describe-images --owners 505638924199 | grep -i imageid

Unable to locate credentials. You can configure credentials by running "aws configure".
rock@MacBookX Terraform % aws ec2 describe-vpc

usage: aws [options] <command> <subcommand> [<subcommand> ...] [parameters]
To see help text, you can run:

  aws help
  aws <command> help
  aws <command> <subcommand> help

aws: error: argument operation: Invalid choice, valid choices are:

accept-reserved-instances-exchange-quote | accept-transit-gateway-multicast-domain-associations
accept-transit-gateway-peering-attachment | accept-transit-gateway-vpc-attachment   
accept-vpc-endpoint-connections          | accept-vpc-peering-connection           
advertise-byoip-cidr                     | allocate-address                        
allocate-hosts                           | apply-security-groups-to-client-vpn-target-network
assign-ipv6-addresses                    | assign-private-ip-addresses             
associate-address                        | associate-client-vpn-target-network     
associate-dhcp-options                   | associate-enclave-certificate-iam-role  
associate-iam-instance-profile           | associate-route-table                   
associate-subnet-cidr-block              | associate-transit-gateway-multicast-domain
associate-transit-gateway-route-table    | associate-vpc-cidr-block                
attach-classic-link-vpc                  | attach-internet-gateway                 
attach-network-interface                 | attach-volume                           
attach-vpn-gateway                       | authorize-client-vpn-ingress            
authorize-security-group-egress          | authorize-security-group-ingress        
bundle-instance                          | cancel-bundle-task                      
cancel-capacity-reservation              | cancel-conversion-task                  
cancel-export-task                       | cancel-import-task                      
cancel-reserved-instances-listing        | cancel-spot-fleet-requests              
cancel-spot-instance-requests            | confirm-product-instance                
copy-fpga-image                          | copy-image                              
copy-snapshot                            | create-capacity-reservation             
create-carrier-gateway                   | create-client-vpn-endpoint              
create-client-vpn-route                  | create-customer-gateway                 
create-default-subnet                    | create-default-vpc                      
create-dhcp-options                      | create-egress-only-internet-gateway     
create-fleet                             | create-flow-logs                        
create-fpga-image                        | create-image                            
create-instance-export-task              | create-internet-gateway                 
create-key-pair                          | create-launch-template                  
create-launch-template-version           | create-local-gateway-route              
create-local-gateway-route-table-vpc-association | create-managed-prefix-list              
create-nat-gateway                       | create-network-acl                      
create-network-acl-entry                 | create-network-insights-path            
create-network-interface                 | create-network-interface-permission     
create-placement-group                   | create-replace-root-volume-task         
create-reserved-instances-listing        | create-route                            
create-route-table                       | create-security-group                   
create-snapshot                          | create-snapshots                        
create-spot-datafeed-subscription        | create-subnet                           
create-tags                              | create-traffic-mirror-filter            
create-traffic-mirror-filter-rule        | create-traffic-mirror-session           
create-traffic-mirror-target             | create-transit-gateway                  
create-transit-gateway-connect           | create-transit-gateway-connect-peer     
create-transit-gateway-multicast-domain  | create-transit-gateway-peering-attachment
create-transit-gateway-prefix-list-reference | create-transit-gateway-route            
create-transit-gateway-route-table       | create-transit-gateway-vpc-attachment   
create-volume                            | create-vpc                              
create-vpc-endpoint                      | create-vpc-endpoint-connection-notification
create-vpc-endpoint-service-configuration | create-vpc-peering-connection           
create-vpn-connection                    | create-vpn-connection-route             
create-vpn-gateway                       | delete-carrier-gateway                  
delete-client-vpn-endpoint               | delete-client-vpn-route                 
delete-customer-gateway                  | delete-dhcp-options                     
delete-egress-only-internet-gateway      | delete-fleets                           
delete-flow-logs                         | delete-fpga-image                       
delete-internet-gateway                  | delete-key-pair                         
delete-launch-template                   | delete-launch-template-versions         
delete-local-gateway-route               | delete-local-gateway-route-table-vpc-association
delete-managed-prefix-list               | delete-nat-gateway                      
delete-network-acl                       | delete-network-acl-entry                
delete-network-insights-analysis         | delete-network-insights-path            
delete-network-interface                 | delete-network-interface-permission     
delete-placement-group                   | delete-queued-reserved-instances        
delete-route                             | delete-route-table                      
delete-security-group                    | delete-snapshot                         
delete-spot-datafeed-subscription        | delete-subnet                           
delete-tags                              | delete-traffic-mirror-filter            
delete-traffic-mirror-filter-rule        | delete-traffic-mirror-session           
delete-traffic-mirror-target             | delete-transit-gateway                  
delete-transit-gateway-connect           | delete-transit-gateway-connect-peer     
delete-transit-gateway-multicast-domain  | delete-transit-gateway-peering-attachment
delete-transit-gateway-prefix-list-reference | delete-transit-gateway-route            
delete-transit-gateway-route-table       | delete-transit-gateway-vpc-attachment   
delete-volume                            | delete-vpc                              
delete-vpc-endpoint-connection-notifications | delete-vpc-endpoint-service-configurations
delete-vpc-endpoints                     | delete-vpc-peering-connection           
delete-vpn-connection                    | delete-vpn-connection-route             
delete-vpn-gateway                       | deprovision-byoip-cidr                  
deregister-image                         | deregister-instance-event-notification-attributes
deregister-transit-gateway-multicast-group-members | deregister-transit-gateway-multicast-group-sources
describe-account-attributes              | describe-addresses                      
describe-addresses-attribute             | describe-aggregate-id-format            
describe-availability-zones              | describe-bundle-tasks                   
describe-byoip-cidrs                     | describe-capacity-reservations          
describe-carrier-gateways                | describe-classic-link-instances         
describe-client-vpn-authorization-rules  | describe-client-vpn-connections         
describe-client-vpn-endpoints            | describe-client-vpn-routes              
describe-client-vpn-target-networks      | describe-coip-pools                     
describe-conversion-tasks                | describe-customer-gateways              
describe-dhcp-options                    | describe-egress-only-internet-gateways  
describe-elastic-gpus                    | describe-export-image-tasks             
describe-export-tasks                    | describe-fast-snapshot-restores         
describe-fleet-history                   | describe-fleet-instances                
describe-fleets                          | describe-flow-logs                      
describe-fpga-image-attribute            | describe-fpga-images                    
describe-host-reservation-offerings      | describe-host-reservations              
describe-hosts                           | describe-iam-instance-profile-associations
describe-id-format                       | describe-identity-id-format             
describe-image-attribute                 | describe-images                         
describe-import-image-tasks              | describe-import-snapshot-tasks          
describe-instance-attribute              | describe-instance-credit-specifications 
describe-instance-event-notification-attributes | describe-instance-status                
describe-instance-type-offerings         | describe-instance-types                 
describe-instances                       | describe-internet-gateways              
describe-ipv6-pools                      | describe-key-pairs                      
describe-launch-template-versions        | describe-launch-templates               
describe-local-gateway-route-table-virtual-interface-group-associations | describe-local-gateway-route-table-vpc-associations
describe-local-gateway-route-tables      | describe-local-gateway-virtual-interface-groups
describe-local-gateway-virtual-interfaces | describe-local-gateways                 
describe-managed-prefix-lists            | describe-moving-addresses               
describe-nat-gateways                    | describe-network-acls                   
describe-network-insights-analyses       | describe-network-insights-paths         
describe-network-interface-attribute     | describe-network-interface-permissions  
describe-network-interfaces              | describe-placement-groups               
describe-prefix-lists                    | describe-principal-id-format            
describe-public-ipv4-pools               | describe-regions                        
describe-replace-root-volume-tasks       | describe-reserved-instances             
describe-reserved-instances-listings     | describe-reserved-instances-modifications
describe-reserved-instances-offerings    | describe-route-tables                   
describe-scheduled-instance-availability | describe-scheduled-instances            
describe-security-group-references       | describe-security-groups                
describe-snapshot-attribute              | describe-snapshots                      
describe-spot-datafeed-subscription      | describe-spot-fleet-instances           
describe-spot-fleet-request-history      | describe-spot-fleet-requests            
describe-spot-instance-requests          | describe-spot-price-history             
describe-stale-security-groups           | describe-subnets                        
describe-tags                            | describe-traffic-mirror-filters         
describe-traffic-mirror-sessions         | describe-traffic-mirror-targets         
describe-transit-gateway-attachments     | describe-transit-gateway-connect-peers  
describe-transit-gateway-connects        | describe-transit-gateway-multicast-domains
describe-transit-gateway-peering-attachments | describe-transit-gateway-route-tables   
describe-transit-gateway-vpc-attachments | describe-transit-gateways               
describe-volume-attribute                | describe-volume-status                  
describe-volumes                         | describe-volumes-modifications          
describe-vpc-attribute                   | describe-vpc-classic-link               
describe-vpc-classic-link-dns-support    | describe-vpc-endpoint-connection-notifications
describe-vpc-endpoint-connections        | describe-vpc-endpoint-service-configurations
describe-vpc-endpoint-service-permissions | describe-vpc-endpoint-services          
describe-vpc-endpoints                   | describe-vpc-peering-connections        
describe-vpcs                            | describe-vpn-connections                
describe-vpn-gateways                    | detach-classic-link-vpc                 
detach-internet-gateway                  | detach-network-interface                
detach-volume                            | detach-vpn-gateway                      
disable-ebs-encryption-by-default        | disable-fast-snapshot-restores          
disable-serial-console-access            | disable-transit-gateway-route-table-propagation
disable-vgw-route-propagation            | disable-vpc-classic-link                
disable-vpc-classic-link-dns-support     | disassociate-address                    
disassociate-client-vpn-target-network   | disassociate-enclave-certificate-iam-role
disassociate-iam-instance-profile        | disassociate-route-table                
disassociate-subnet-cidr-block           | disassociate-transit-gateway-multicast-domain
disassociate-transit-gateway-route-table | disassociate-vpc-cidr-block             
enable-ebs-encryption-by-default         | enable-fast-snapshot-restores           
enable-serial-console-access             | enable-transit-gateway-route-table-propagation
enable-vgw-route-propagation             | enable-volume-io                        
enable-vpc-classic-link                  | enable-vpc-classic-link-dns-support     
export-client-vpn-client-certificate-revocation-list | export-client-vpn-client-configuration  
export-image                             | export-transit-gateway-routes           
get-associated-enclave-certificate-iam-roles | get-associated-ipv6-pool-cidrs          
get-capacity-reservation-usage           | get-coip-pool-usage                     
get-console-output                       | get-console-screenshot                  
get-default-credit-specification         | get-ebs-default-kms-key-id              
get-ebs-encryption-by-default            | get-groups-for-capacity-reservation     
get-host-reservation-purchase-preview    | get-launch-template-data                
get-managed-prefix-list-associations     | get-managed-prefix-list-entries         
get-password-data                        | get-reserved-instances-exchange-quote   
get-serial-console-access-status         | get-transit-gateway-attachment-propagations
get-transit-gateway-multicast-domain-associations | get-transit-gateway-prefix-list-references
get-transit-gateway-route-table-associations | get-transit-gateway-route-table-propagations
import-client-vpn-client-certificate-revocation-list | import-image                            
import-key-pair                          | import-snapshot                         
modify-address-attribute                 | modify-availability-zone-group          
modify-capacity-reservation              | modify-client-vpn-endpoint              
modify-default-credit-specification      | modify-ebs-default-kms-key-id           
modify-fleet                             | modify-fpga-image-attribute             
modify-hosts                             | modify-id-format                        
modify-identity-id-format                | modify-image-attribute                  
modify-instance-attribute                | modify-instance-capacity-reservation-attributes
modify-instance-credit-specification     | modify-instance-event-start-time        
modify-instance-metadata-options         | modify-instance-placement               
modify-launch-template                   | modify-managed-prefix-list              
modify-network-interface-attribute       | modify-reserved-instances               
modify-snapshot-attribute                | modify-spot-fleet-request               
modify-subnet-attribute                  | modify-traffic-mirror-filter-network-services
modify-traffic-mirror-filter-rule        | modify-traffic-mirror-session           
modify-transit-gateway                   | modify-transit-gateway-prefix-list-reference
modify-transit-gateway-vpc-attachment    | modify-volume                           
modify-volume-attribute                  | modify-vpc-attribute                    
modify-vpc-endpoint                      | modify-vpc-endpoint-connection-notification
modify-vpc-endpoint-service-configuration | modify-vpc-endpoint-service-permissions 
modify-vpc-peering-connection-options    | modify-vpc-tenancy                      
modify-vpn-connection                    | modify-vpn-connection-options           
modify-vpn-tunnel-certificate            | modify-vpn-tunnel-options               
monitor-instances                        | move-address-to-vpc                     
provision-byoip-cidr                     | purchase-host-reservation               
purchase-reserved-instances-offering     | purchase-scheduled-instances            
reboot-instances                         | register-image                          
register-instance-event-notification-attributes | register-transit-gateway-multicast-group-members
register-transit-gateway-multicast-group-sources | reject-transit-gateway-multicast-domain-associations
reject-transit-gateway-peering-attachment | reject-transit-gateway-vpc-attachment   
reject-vpc-endpoint-connections          | reject-vpc-peering-connection           
release-address                          | release-hosts                           
replace-iam-instance-profile-association | replace-network-acl-association         
replace-network-acl-entry                | replace-route                           
replace-route-table-association          | replace-transit-gateway-route           
report-instance-status                   | request-spot-fleet                      
request-spot-instances                   | reset-address-attribute                 
reset-ebs-default-kms-key-id             | reset-fpga-image-attribute              
reset-image-attribute                    | reset-instance-attribute                
reset-network-interface-attribute        | reset-snapshot-attribute                
restore-address-to-classic               | restore-managed-prefix-list-version     
revoke-client-vpn-ingress                | revoke-security-group-egress            
revoke-security-group-ingress            | run-instances                           
run-scheduled-instances                  | search-local-gateway-routes             
search-transit-gateway-multicast-groups  | search-transit-gateway-routes           
send-diagnostic-interrupt                | start-instances                         
start-network-insights-analysis          | start-vpc-endpoint-service-private-dns-verification
stop-instances                           | terminate-client-vpn-connections        
terminate-instances                      | unassign-ipv6-addresses                 
unassign-private-ip-addresses            | unmonitor-instances                     
update-security-group-rule-descriptions-egress | update-security-group-rule-descriptions-ingress
withdraw-byoip-cidr                      | wait                                    
help                                    


Invalid choice: 'describe-vpc', maybe you meant:

  * describe-vpcs

rock@MacBookX Terraform % aws ec2 describe-vpcs

Unable to locate credentials. You can configure credentials by running "aws configure".
rock@MacBookX Terraform % aws configure
AWS Access Key ID [None]: AKIATCXWQ5VA7EC3PZL2
AWS Secret Access Key [None]: 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
Default region name [us-west-1]: 
Default output format [None]: json
rock@MacBookX Terraform % aws ec2 describe-vpcs
{
    "Vpcs": [
        {
            "CidrBlock": "172.31.0.0/16",
            "DhcpOptionsId": "dopt-13846e75",
            "State": "available",
            "VpcId": "vpc-08867d6e",
            "OwnerId": "212044148033",
            "InstanceTenancy": "default",
            "CidrBlockAssociationSet": [
                {
                    "AssociationId": "vpc-cidr-assoc-7abf1c11",
                    "CidrBlock": "172.31.0.0/16",
                    "CidrBlockState": {
                        "State": "associated"
                    }
                }
            ],
            "IsDefault": true
        }
    ]
}
rock@MacBookX Terraform % aws ec2 describe-images --owners 505638924199 | grep -i imageid
            "ImageId": "ami-02dfefa1b0767040c",
            "ImageId": "ami-08fe9fc13a1d26909",
            "ImageId": "ami-0b06d29e772c8cbca",
rock@MacBookX Terraform % terraform init

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.35.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
rock@MacBookX Terraform % terraform plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dc will be created
  + resource "aws_instance" "dc" {
      + ami                          = "ami-0b06d29e772c8cbca"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.102"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "dc.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.logger will be created
  + resource "aws_instance" "logger" {
      + ami                          = "ami-0f42d8c4eb586ccf7"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "id_logger"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.105"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "logger"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 64
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.wef will be created
  + resource "aws_instance" "wef" {
      + ami                          = "ami-02dfefa1b0767040c"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.103"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "wef.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.win10 will be created
  + resource "aws_instance" "win10" {
      + ami                          = "ami-08fe9fc13a1d26909"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.104"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "win10.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.default will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.auth will be created
  + resource "aws_key_pair" "auth" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "id_logger"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC519klzOYWSzc1EH5M+VKu3XfWyusVeaYs9yUoDuwaqFP7397wJ3qbKmCH/+llyOolyWfwiP9e7R0GnLVvqidAoM2zQhzqg2B9D0t1OyCNvSrXtK5+bkdS3WRzIHMSsfIhfIxyQWq35JmyEuC/ePTQ183fCtYAjOJeHQjgJI2NH9waKsfH7382+3MQisGYJr0h45rMMjcwLC2KBduOXk551Qh/0Zj87ml3ns2+ykW4tM00b64OS4Ak2SyPYBg9FruIVUiklY00+wO58g9vBc5dKF3wPQWiu+SoSm6568id1gyaphIi0mVdCUD1NZkTyKkr4ldctwQfbhgkmFibBPLF rock@MacBookX.local"
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_security_group.logger will be created
  + resource "aws_security_group" "logger" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security Group for the logger host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8412
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8412
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 9999
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9999
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "logger_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.windows will be created
  + resource "aws_security_group" "windows" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security group for the Windows hosts"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 5985
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5986
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "windows_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.default will be created
  + resource "aws_subnet" "default" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.38.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # aws_vpc_dhcp_options.default will be created
  + resource "aws_vpc_dhcp_options" "default" {
      + arn                  = (known after apply)
      + domain_name          = "windomain.local"
      + domain_name_servers  = [
          + "192.168.38.102",
          + "8.8.8.8",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = [
          + "192.168.38.102",
        ]
      + owner_id             = (known after apply)
    }

  # aws_vpc_dhcp_options_association.default will be created
  + resource "aws_vpc_dhcp_options_association" "default" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ata_url          = (known after apply)
  + dc_public_ip     = (known after apply)
  + fleet_url        = (known after apply)
  + guacamole_url    = (known after apply)
  + logger_public_ip = (known after apply)
  + region           = "us-west-1"
  + splunk_url       = (known after apply)
  + velociraptor_url = (known after apply)
  + wef_public_ip    = (known after apply)
  + win10_public_ip  = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

rock@MacBookX Terraform % terraform plan -out
Usage: terraform plan [options] [DIR]

  Generates a speculative execution plan, showing what actions Terraform
  would take to apply the current configuration. This command will not
  actually perform the planned actions.

  You can optionally save the plan to a file, which you can then pass to
  the "apply" command to perform exactly the actions described in the plan.

Options:

  -compact-warnings   If Terraform produces any warnings that are not
                      accompanied by errors, show them in a more compact form
                      that includes only the summary messages.

  -destroy            If set, a plan will be generated to destroy all resources
                      managed by the given configuration and state.

  -detailed-exitcode  Return detailed exit codes when the command exits. This
                      will change the meaning of exit codes to:
                      0 - Succeeded, diff is empty (no changes)
                      1 - Errored
                      2 - Succeeded, there is a diff

  -input=true         Ask for input for variables if not directly set.

  -lock=true          Lock the state file when locking is supported.

  -lock-timeout=0s    Duration to retry a state lock.

  -no-color           If specified, output won't contain any color.

  -out=path           Write a plan file to the given path. This can be used as
                      input to the "apply" command.

  -parallelism=n      Limit the number of concurrent operations. Defaults to 10.

  -refresh=true       Update state prior to checking for differences.

  -state=statefile    Path to a Terraform state file to use to look
                      up Terraform-managed resources. By default it will
                      use the state "terraform.tfstate" if it exists.

  -target=resource    Resource to target. Operation will be limited to this
                      resource and its dependencies. This flag can be used
                      multiple times.

  -var 'foo=bar'      Set a variable in the Terraform configuration. This
                      flag can be set multiple times.

  -var-file=foo       Set variables in the Terraform configuration from
                      a file. If "terraform.tfvars" or any ".auto.tfvars"
                      files are present, they will be automatically loaded.
rock@MacBookX Terraform % clear

rock@MacBookX Terraform % clear























rock@MacBookX Terraform % terraform plan     

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dc will be created
  + resource "aws_instance" "dc" {
      + ami                          = "ami-0b06d29e772c8cbca"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.102"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "dc.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.logger will be created
  + resource "aws_instance" "logger" {
      + ami                          = "ami-0f42d8c4eb586ccf7"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "id_logger"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.105"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "logger"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 64
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.wef will be created
  + resource "aws_instance" "wef" {
      + ami                          = "ami-02dfefa1b0767040c"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.103"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "wef.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.win10 will be created
  + resource "aws_instance" "win10" {
      + ami                          = "ami-08fe9fc13a1d26909"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.104"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "win10.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.default will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.auth will be created
  + resource "aws_key_pair" "auth" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "id_logger"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC519klzOYWSzc1EH5M+VKu3XfWyusVeaYs9yUoDuwaqFP7397wJ3qbKmCH/+llyOolyWfwiP9e7R0GnLVvqidAoM2zQhzqg2B9D0t1OyCNvSrXtK5+bkdS3WRzIHMSsfIhfIxyQWq35JmyEuC/ePTQ183fCtYAjOJeHQjgJI2NH9waKsfH7382+3MQisGYJr0h45rMMjcwLC2KBduOXk551Qh/0Zj87ml3ns2+ykW4tM00b64OS4Ak2SyPYBg9FruIVUiklY00+wO58g9vBc5dKF3wPQWiu+SoSm6568id1gyaphIi0mVdCUD1NZkTyKkr4ldctwQfbhgkmFibBPLF rock@MacBookX.local"
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_security_group.logger will be created
  + resource "aws_security_group" "logger" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security Group for the logger host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8412
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8412
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 9999
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9999
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "logger_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.windows will be created
  + resource "aws_security_group" "windows" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security group for the Windows hosts"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 5985
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5986
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "windows_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.default will be created
  + resource "aws_subnet" "default" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.38.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # aws_vpc_dhcp_options.default will be created
  + resource "aws_vpc_dhcp_options" "default" {
      + arn                  = (known after apply)
      + domain_name          = "windomain.local"
      + domain_name_servers  = [
          + "192.168.38.102",
          + "8.8.8.8",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = [
          + "192.168.38.102",
        ]
      + owner_id             = (known after apply)
    }

  # aws_vpc_dhcp_options_association.default will be created
  + resource "aws_vpc_dhcp_options_association" "default" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ata_url          = (known after apply)
  + dc_public_ip     = (known after apply)
  + fleet_url        = (known after apply)
  + guacamole_url    = (known after apply)
  + logger_public_ip = (known after apply)
  + region           = "us-west-1"
  + splunk_url       = (known after apply)
  + velociraptor_url = (known after apply)
  + wef_public_ip    = (known after apply)
  + win10_public_ip  = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

rock@MacBookX Terraform % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dc will be created
  + resource "aws_instance" "dc" {
      + ami                          = "ami-0b06d29e772c8cbca"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.102"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "dc.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.logger will be created
  + resource "aws_instance" "logger" {
      + ami                          = "ami-0f42d8c4eb586ccf7"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "id_logger"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.105"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "logger"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 64
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.wef will be created
  + resource "aws_instance" "wef" {
      + ami                          = "ami-02dfefa1b0767040c"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.103"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "wef.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.win10 will be created
  + resource "aws_instance" "win10" {
      + ami                          = "ami-08fe9fc13a1d26909"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.104"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "win10.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.default will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.auth will be created
  + resource "aws_key_pair" "auth" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "id_logger"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC519klzOYWSzc1EH5M+VKu3XfWyusVeaYs9yUoDuwaqFP7397wJ3qbKmCH/+llyOolyWfwiP9e7R0GnLVvqidAoM2zQhzqg2B9D0t1OyCNvSrXtK5+bkdS3WRzIHMSsfIhfIxyQWq35JmyEuC/ePTQ183fCtYAjOJeHQjgJI2NH9waKsfH7382+3MQisGYJr0h45rMMjcwLC2KBduOXk551Qh/0Zj87ml3ns2+ykW4tM00b64OS4Ak2SyPYBg9FruIVUiklY00+wO58g9vBc5dKF3wPQWiu+SoSm6568id1gyaphIi0mVdCUD1NZkTyKkr4ldctwQfbhgkmFibBPLF rock@MacBookX.local"
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_security_group.logger will be created
  + resource "aws_security_group" "logger" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security Group for the logger host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8412
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8412
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 9999
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9999
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "logger_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.windows will be created
  + resource "aws_security_group" "windows" {
      + arn                    = (known after apply)
      + description            = "DetectionLab: Security group for the Windows hosts"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/32",
                ]
              + description      = ""
              + from_port        = 5985
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5986
            },
          + {
              + cidr_blocks      = [
                  + "192.168.38.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "windows_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.default will be created
  + resource "aws_subnet" "default" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.38.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # aws_vpc_dhcp_options.default will be created
  + resource "aws_vpc_dhcp_options" "default" {
      + arn                  = (known after apply)
      + domain_name          = "windomain.local"
      + domain_name_servers  = [
          + "192.168.38.102",
          + "8.8.8.8",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = [
          + "192.168.38.102",
        ]
      + owner_id             = (known after apply)
    }

  # aws_vpc_dhcp_options_association.default will be created
  + resource "aws_vpc_dhcp_options_association" "default" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ata_url          = (known after apply)
  + dc_public_ip     = (known after apply)
  + fleet_url        = (known after apply)
  + guacamole_url    = (known after apply)
  + logger_public_ip = (known after apply)
  + region           = "us-west-1"
  + splunk_url       = (known after apply)
  + velociraptor_url = (known after apply)
  + wef_public_ip    = (known after apply)
  + win10_public_ip  = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_key_pair.auth: Creating...
aws_vpc.default: Creating...
aws_key_pair.auth: Creation complete after 2s [id=id_logger]
aws_vpc.default: Creation complete after 9s [id=vpc-0c899dbbba2c3a87a]
aws_internet_gateway.default: Creating...
aws_subnet.default: Creating...
aws_security_group.windows: Creating...
aws_security_group.logger: Creating...
aws_internet_gateway.default: Creation complete after 4s [id=igw-05720bf840cd328d7]
aws_route.internet_access: Creating...
aws_route.internet_access: Creation complete after 2s [id=r-rtb-02ec43507e6f1260f1080289494]
aws_security_group.logger: Creation complete after 7s [id=sg-0c66418e51da622ff]
aws_security_group.windows: Creation complete after 7s [id=sg-09bebec9ae2fc03de]
aws_subnet.default: Still creating... [10s elapsed]
aws_subnet.default: Creation complete after 14s [id=subnet-053bd3fb59c015c2e]
aws_instance.logger: Creating...
aws_instance.dc: Creating...
aws_instance.wef: Creating...
aws_instance.win10: Creating...
aws_instance.dc: Still creating... [10s elapsed]
aws_instance.wef: Still creating... [10s elapsed]
aws_instance.dc: Provisioning with 'remote-exec'...
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef: Provisioning with 'remote-exec'...
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [20s elapsed]
aws_instance.wef: Still creating... [20s elapsed]
aws_instance.dc: Still creating... [30s elapsed]
aws_instance.wef: Still creating... [30s elapsed]
aws_instance.wef: Still creating... [40s elapsed]
aws_instance.dc: Still creating... [40s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [50s elapsed]
aws_instance.dc: Still creating... [50s elapsed]
aws_instance.dc: Still creating... [1m0s elapsed]
aws_instance.wef: Still creating... [1m0s elapsed]
aws_instance.dc: Still creating... [1m10s elapsed]
aws_instance.wef: Still creating... [1m10s elapsed]
aws_instance.wef: Still creating... [1m20s elapsed]
aws_instance.dc: Still creating... [1m20s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [1m30s elapsed]
aws_instance.wef: Still creating... [1m30s elapsed]
aws_instance.dc: Still creating... [1m40s elapsed]
aws_instance.wef: Still creating... [1m40s elapsed]
aws_instance.dc: Still creating... [1m50s elapsed]
aws_instance.wef: Still creating... [1m50s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [2m0s elapsed]
aws_instance.dc: Still creating... [2m0s elapsed]
aws_instance.wef: Still creating... [2m10s elapsed]
aws_instance.dc: Still creating... [2m10s elapsed]
aws_instance.wef: Still creating... [2m20s elapsed]
aws_instance.dc: Still creating... [2m20s elapsed]
aws_instance.wef: Still creating... [2m30s elapsed]
aws_instance.dc: Still creating... [2m30s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [2m40s elapsed]
aws_instance.dc: Still creating... [2m40s elapsed]
aws_instance.dc: Still creating... [2m50s elapsed]
aws_instance.wef: Still creating... [2m50s elapsed]
aws_instance.wef: Still creating... [3m0s elapsed]
aws_instance.dc: Still creating... [3m0s elapsed]
aws_instance.dc: Still creating... [3m10s elapsed]
aws_instance.wef: Still creating... [3m10s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [3m20s elapsed]
aws_instance.wef: Still creating... [3m20s elapsed]
aws_instance.dc: Still creating... [3m30s elapsed]
aws_instance.wef: Still creating... [3m30s elapsed]
aws_instance.wef: Still creating... [3m40s elapsed]
aws_instance.dc: Still creating... [3m40s elapsed]
aws_instance.dc: Still creating... [3m50s elapsed]
aws_instance.wef: Still creating... [3m50s elapsed]
aws_instance.wef: Still creating... [4m0s elapsed]
aws_instance.dc: Still creating... [4m0s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [4m10s elapsed]
aws_instance.dc: Still creating... [4m10s elapsed]
aws_instance.dc: Still creating... [4m20s elapsed]
aws_instance.wef: Still creating... [4m20s elapsed]
aws_instance.wef: Still creating... [4m30s elapsed]
aws_instance.dc: Still creating... [4m30s elapsed]
aws_instance.dc: Still creating... [4m40s elapsed]
aws_instance.wef: Still creating... [4m40s elapsed]
aws_instance.dc: Still creating... [4m50s elapsed]
aws_instance.wef: Still creating... [4m50s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 52.53.227.18
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 13.57.20.213
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [5m0s elapsed]
aws_instance.dc: Still creating... [5m0s elapsed]
aws_instance.wef: Still creating... [5m10s elapsed]
aws_instance.dc: Still creating... [5m10s elapsed]



Error: timeout - last error: unknown error Post "http://13.57.20.213:5985/wsman": dial tcp 13.57.20.213:5985: i/o timeout



Error: timeout - last error: unknown error Post "http://52.53.227.18:5985/wsman": dial tcp 52.53.227.18:5985: i/o timeout



Error: Error launching source instance: PendingVerification: Your request for accessing resources in this region is being validated, and you will not be able to launch additional resources in this region until the validation is complete. We will notify you by email once your request has been validated. While normally resolved within minutes, please allow up to 4 hours for this process to complete. If the issue still persists, please let us know by writing to aws-verification@amazon.com for further assistance.
        status code: 400, request id: bcb94c6c-a2d0-4652-a143-6aed4df552cc

  on main.tf line 171, in resource "aws_instance" "logger":
 171: resource "aws_instance" "logger" {



Error: Error launching source instance: PendingVerification: Your request for accessing resources in this region is being validated, and you will not be able to launch additional resources in this region until the validation is complete. We will notify you by email once your request has been validated. While normally resolved within minutes, please allow up to 4 hours for this process to complete. If the issue still persists, please let us know by writing to aws-verification@amazon.com for further assistance.
        status code: 400, request id: 78750b1a-b20d-4e32-9967-a84ce6b51184

  on main.tf line 325, in resource "aws_instance" "win10":
 325: resource "aws_instance" "win10" {


rock@MacBookX Terraform % terraform plan 
aws_key_pair.auth: Refreshing state... [id=id_logger]
aws_vpc.default: Refreshing state... [id=vpc-0c899dbbba2c3a87a]
aws_internet_gateway.default: Refreshing state... [id=igw-05720bf840cd328d7]
aws_subnet.default: Refreshing state... [id=subnet-053bd3fb59c015c2e]
aws_security_group.windows: Refreshing state... [id=sg-09bebec9ae2fc03de]
aws_security_group.logger: Refreshing state... [id=sg-0c66418e51da622ff]
aws_instance.dc: Refreshing state... [id=i-03dba92401972364a]
aws_instance.wef: Refreshing state... [id=i-03f902b8533d77456]
aws_route.internet_access: Refreshing state... [id=r-rtb-02ec43507e6f1260f1080289494]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.dc is tainted, so must be replaced
-/+ resource "aws_instance" "dc" {
      ~ arn                          = "arn:aws:ec2:us-west-1:212044148033:instance/i-03dba92401972364a" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03dba92401972364a" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02ebe9e67f7f3deeb" -> (known after apply)
      ~ private_dns                  = "ip-192-168-38-102.us-west-1.compute.internal" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "52.53.227.18" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        tags                         = {
            "Name" = "dc.windomain.local"
        }
      ~ tenancy                      = "default" -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 180 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09ca2697bc8aa6e57" -> (known after apply)
          ~ volume_size           = 60 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_instance.logger will be created
  + resource "aws_instance" "logger" {
      + ami                          = "ami-0f42d8c4eb586ccf7"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "id_logger"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.105"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-053bd3fb59c015c2e"
      + tags                         = {
          + "Name" = "logger"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "sg-0c66418e51da622ff",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 64
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.wef is tainted, so must be replaced
-/+ resource "aws_instance" "wef" {
      ~ arn                          = "arn:aws:ec2:us-west-1:212044148033:instance/i-03f902b8533d77456" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03f902b8533d77456" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-084adc186b5bb50fe" -> (known after apply)
      ~ private_dns                  = "ip-192-168-38-103.us-west-1.compute.internal" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "13.57.20.213" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        tags                         = {
            "Name" = "wef.windomain.local"
        }
      ~ tenancy                      = "default" -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 180 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-08ecb0e89d54eaea0" -> (known after apply)
          ~ volume_size           = 60 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_instance.win10 will be created
  + resource "aws_instance" "win10" {
      + ami                          = "ami-08fe9fc13a1d26909"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.104"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-053bd3fb59c015c2e"
      + tags                         = {
          + "Name" = "win10.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "sg-09bebec9ae2fc03de",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_vpc_dhcp_options.default will be created
  + resource "aws_vpc_dhcp_options" "default" {
      + arn                  = (known after apply)
      + domain_name          = "windomain.local"
      + domain_name_servers  = [
          + "192.168.38.102",
          + "8.8.8.8",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = [
          + "192.168.38.102",
        ]
      + owner_id             = (known after apply)
    }

  # aws_vpc_dhcp_options_association.default will be created
  + resource "aws_vpc_dhcp_options_association" "default" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = "vpc-0c899dbbba2c3a87a"
    }

Plan: 6 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + ata_url          = (known after apply)
  + dc_public_ip     = (known after apply)
  + fleet_url        = (known after apply)
  + guacamole_url    = (known after apply)
  + logger_public_ip = (known after apply)
  + splunk_url       = (known after apply)
  + velociraptor_url = (known after apply)
  + wef_public_ip    = (known after apply)
  + win10_public_ip  = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

rock@MacBookX Terraform % terraform apply
aws_key_pair.auth: Refreshing state... [id=id_logger]
aws_vpc.default: Refreshing state... [id=vpc-0c899dbbba2c3a87a]
aws_subnet.default: Refreshing state... [id=subnet-053bd3fb59c015c2e]
aws_internet_gateway.default: Refreshing state... [id=igw-05720bf840cd328d7]
aws_security_group.windows: Refreshing state... [id=sg-09bebec9ae2fc03de]
aws_security_group.logger: Refreshing state... [id=sg-0c66418e51da622ff]
aws_route.internet_access: Refreshing state... [id=r-rtb-02ec43507e6f1260f1080289494]
aws_instance.dc: Refreshing state... [id=i-03dba92401972364a]
aws_instance.wef: Refreshing state... [id=i-03f902b8533d77456]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.dc is tainted, so must be replaced
-/+ resource "aws_instance" "dc" {
      ~ arn                          = "arn:aws:ec2:us-west-1:212044148033:instance/i-03dba92401972364a" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03dba92401972364a" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02ebe9e67f7f3deeb" -> (known after apply)
      ~ private_dns                  = "ip-192-168-38-102.us-west-1.compute.internal" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "52.53.227.18" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        tags                         = {
            "Name" = "dc.windomain.local"
        }
      ~ tenancy                      = "default" -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 180 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09ca2697bc8aa6e57" -> (known after apply)
          ~ volume_size           = 60 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_instance.logger will be created
  + resource "aws_instance" "logger" {
      + ami                          = "ami-0f42d8c4eb586ccf7"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "id_logger"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.105"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-053bd3fb59c015c2e"
      + tags                         = {
          + "Name" = "logger"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "sg-0c66418e51da622ff",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 64
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.wef is tainted, so must be replaced
-/+ resource "aws_instance" "wef" {
      ~ arn                          = "arn:aws:ec2:us-west-1:212044148033:instance/i-03f902b8533d77456" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03f902b8533d77456" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-084adc186b5bb50fe" -> (known after apply)
      ~ private_dns                  = "ip-192-168-38-103.us-west-1.compute.internal" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "13.57.20.213" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        tags                         = {
            "Name" = "wef.windomain.local"
        }
      ~ tenancy                      = "default" -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 180 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-08ecb0e89d54eaea0" -> (known after apply)
          ~ volume_size           = 60 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_instance.win10 will be created
  + resource "aws_instance" "win10" {
      + ami                          = "ami-08fe9fc13a1d26909"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = "192.168.38.104"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-053bd3fb59c015c2e"
      + tags                         = {
          + "Name" = "win10.windomain.local"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "sg-09bebec9ae2fc03de",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_vpc_dhcp_options.default will be created
  + resource "aws_vpc_dhcp_options" "default" {
      + arn                  = (known after apply)
      + domain_name          = "windomain.local"
      + domain_name_servers  = [
          + "192.168.38.102",
          + "8.8.8.8",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = [
          + "192.168.38.102",
        ]
      + owner_id             = (known after apply)
    }

  # aws_vpc_dhcp_options_association.default will be created
  + resource "aws_vpc_dhcp_options_association" "default" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = "vpc-0c899dbbba2c3a87a"
    }

Plan: 6 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + ata_url          = (known after apply)
  + dc_public_ip     = (known after apply)
  + fleet_url        = (known after apply)
  + guacamole_url    = (known after apply)
  + logger_public_ip = (known after apply)
  + splunk_url       = (known after apply)
  + velociraptor_url = (known after apply)
  + wef_public_ip    = (known after apply)
  + win10_public_ip  = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_instance.dc: Destroying... [id=i-03dba92401972364a]
aws_instance.wef: Destroying... [id=i-03f902b8533d77456]
aws_instance.win10: Creating...
aws_instance.logger: Creating...
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 10s elapsed]
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 10s elapsed]
aws_instance.win10: Still creating... [10s elapsed]
aws_instance.logger: Still creating... [10s elapsed]
aws_instance.logger: Provisioning with 'remote-exec'...
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 20s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 20s elapsed]
aws_instance.logger: Still creating... [20s elapsed]
aws_instance.win10: Still creating... [20s elapsed]
aws_instance.win10: Provisioning with 'remote-exec'...
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 30s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 30s elapsed]
aws_instance.win10: Still creating... [30s elapsed]
aws_instance.logger: Still creating... [30s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 40s elapsed]
aws_instance.win10: Still creating... [40s elapsed]
aws_instance.logger: Still creating... [40s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 40s elapsed]
aws_instance.win10: Still creating... [50s elapsed]
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 50s elapsed]
aws_instance.logger: Still creating... [50s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 50s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.logger: Still creating... [1m0s elapsed]
aws_instance.win10: Still creating... [1m0s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 1m0s elapsed]
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 1m0s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.logger: Still creating... [1m10s elapsed]
aws_instance.dc: Still destroying... [id=i-03dba92401972364a, 1m10s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 1m10s elapsed]
aws_instance.win10: Still creating... [1m10s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Destruction complete after 1m16s
aws_instance.dc: Creating...
aws_instance.logger: Still creating... [1m20s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 1m20s elapsed]
aws_instance.win10: Still creating... [1m20s elapsed]
aws_instance.dc: Still creating... [10s elapsed]
aws_instance.logger: Still creating... [1m30s elapsed]
aws_instance.wef: Still destroying... [id=i-03f902b8533d77456, 1m30s elapsed]
aws_instance.win10: Still creating... [1m30s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Provisioning with 'remote-exec'...
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.dc: Still creating... [20s elapsed]
aws_instance.wef: Destruction complete after 1m38s
aws_instance.wef: Creating...
aws_instance.logger: Still creating... [1m40s elapsed]
aws_instance.win10: Still creating... [1m40s elapsed]
aws_instance.dc: Still creating... [30s elapsed]
aws_instance.wef: Still creating... [10s elapsed]
aws_instance.logger: Still creating... [1m50s elapsed]
aws_instance.win10: Still creating... [1m50s elapsed]
aws_instance.dc: Still creating... [40s elapsed]
aws_instance.wef: Provisioning with 'remote-exec'...
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [20s elapsed]
aws_instance.win10: Still creating... [2m0s elapsed]
aws_instance.logger: Still creating... [2m0s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.dc: Still creating... [50s elapsed]
aws_instance.wef: Still creating... [30s elapsed]
aws_instance.logger: Still creating... [2m10s elapsed]
aws_instance.win10: Still creating... [2m10s elapsed]
aws_instance.dc: Still creating... [1m0s elapsed]
aws_instance.wef: Still creating... [40s elapsed]
aws_instance.logger: Still creating... [2m20s elapsed]
aws_instance.win10: Still creating... [2m20s elapsed]
aws_instance.dc: Still creating... [1m10s elapsed]
aws_instance.wef: Still creating... [50s elapsed]
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.win10: Still creating... [2m30s elapsed]
aws_instance.logger: Still creating... [2m30s elapsed]
aws_instance.dc: Still creating... [1m20s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.wef: Still creating... [1m0s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.logger: Still creating... [2m40s elapsed]
aws_instance.win10: Still creating... [2m40s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.dc: Still creating... [1m30s elapsed]
aws_instance.wef: Still creating... [1m10s elapsed]
aws_instance.logger: Still creating... [2m50s elapsed]
aws_instance.win10: Still creating... [2m50s elapsed]
aws_instance.dc: Still creating... [1m40s elapsed]
aws_instance.wef: Still creating... [1m20s elapsed]
aws_instance.win10: Still creating... [3m0s elapsed]
aws_instance.logger: Still creating... [3m0s elapsed]
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [1m50s elapsed]
aws_instance.wef: Still creating... [1m30s elapsed]
aws_instance.logger: Still creating... [3m10s elapsed]
aws_instance.win10: Still creating... [3m10s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Still creating... [2m0s elapsed]
aws_instance.wef: Still creating... [1m40s elapsed]
aws_instance.win10: Still creating... [3m20s elapsed]
aws_instance.logger: Still creating... [3m20s elapsed]
aws_instance.dc: Still creating... [2m10s elapsed]
aws_instance.wef: Still creating... [1m50s elapsed]
aws_instance.win10: Still creating... [3m30s elapsed]
aws_instance.logger: Still creating... [3m30s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [2m20s elapsed]
aws_instance.wef: Still creating... [2m0s elapsed]
aws_instance.logger: Still creating... [3m40s elapsed]
aws_instance.win10: Still creating... [3m40s elapsed]
aws_instance.dc: Still creating... [2m30s elapsed]
aws_instance.wef: Still creating... [2m10s elapsed]
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.win10: Still creating... [3m50s elapsed]
aws_instance.logger: Still creating... [3m50s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.dc: Still creating... [2m40s elapsed]
aws_instance.wef: Still creating... [2m20s elapsed]
aws_instance.win10: Still creating... [4m0s elapsed]
aws_instance.logger: Still creating... [4m0s elapsed]
aws_instance.dc: Still creating... [2m50s elapsed]
aws_instance.wef: Still creating... [2m30s elapsed]
aws_instance.logger: Still creating... [4m10s elapsed]
aws_instance.win10: Still creating... [4m10s elapsed]
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [3m0s elapsed]
aws_instance.wef: Still creating... [2m40s elapsed]
aws_instance.win10: Still creating... [4m20s elapsed]
aws_instance.logger: Still creating... [4m20s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.dc: Still creating... [3m10s elapsed]
aws_instance.wef: Still creating... [2m50s elapsed]
aws_instance.win10: Still creating... [4m30s elapsed]
aws_instance.logger: Still creating... [4m30s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.dc: Still creating... [3m20s elapsed]
aws_instance.wef: Still creating... [3m0s elapsed]
aws_instance.logger: Still creating... [4m40s elapsed]
aws_instance.win10: Still creating... [4m40s elapsed]
aws_instance.dc: Still creating... [3m30s elapsed]
aws_instance.wef: Still creating... [3m10s elapsed]
aws_instance.logger: Still creating... [4m50s elapsed]
aws_instance.win10: Still creating... [4m50s elapsed]
aws_instance.dc: Still creating... [3m40s elapsed]
aws_instance.wef: Still creating... [3m20s elapsed]
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.logger (remote-exec): Connecting to remote host via SSH...
aws_instance.logger (remote-exec):   Host: 3.101.130.214
aws_instance.logger (remote-exec):   User: ubuntu
aws_instance.logger (remote-exec):   Password: false
aws_instance.logger (remote-exec):   Private key: true
aws_instance.logger (remote-exec):   Certificate: false
aws_instance.logger (remote-exec):   SSH Agent: true
aws_instance.logger (remote-exec):   Checking Host Key: false
aws_instance.logger (remote-exec):   Target Platform: unix
aws_instance.logger: Still creating... [5m0s elapsed]
aws_instance.win10: Still creating... [5m0s elapsed]
aws_instance.dc: Still creating... [3m50s elapsed]
aws_instance.wef: Still creating... [3m30s elapsed]
aws_instance.logger: Still creating... [5m10s elapsed]
aws_instance.win10: Still creating... [5m10s elapsed]
aws_instance.win10 (remote-exec): Connecting to remote host via WinRM...
aws_instance.win10 (remote-exec):   Host: 52.53.190.108
aws_instance.win10 (remote-exec):   Port: 5985
aws_instance.win10 (remote-exec):   User: vagrant
aws_instance.win10 (remote-exec):   Password: true
aws_instance.win10 (remote-exec):   HTTPS: false
aws_instance.win10 (remote-exec):   Insecure: false
aws_instance.win10 (remote-exec):   NTLM: false
aws_instance.win10 (remote-exec):   CACert: false
aws_instance.dc: Still creating... [4m0s elapsed]
aws_instance.wef: Still creating... [3m40s elapsed]

aws_instance.win10: Still creating... [5m20s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.dc: Still creating... [4m10s elapsed]
aws_instance.wef: Still creating... [3m50s elapsed]

aws_instance.dc: Still creating... [4m20s elapsed]
aws_instance.wef: Still creating... [4m0s elapsed]
aws_instance.dc: Still creating... [4m30s elapsed]
aws_instance.wef: Still creating... [4m10s elapsed]
aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.dc: Still creating... [4m40s elapsed]
aws_instance.wef: Still creating... [4m20s elapsed]
aws_instance.dc: Still creating... [4m50s elapsed]
aws_instance.wef: Still creating... [4m30s elapsed]
aws_instance.dc (remote-exec): Connecting to remote host via WinRM...
aws_instance.dc (remote-exec):   Host: 54.193.103.250
aws_instance.dc (remote-exec):   Port: 5985
aws_instance.dc (remote-exec):   User: vagrant
aws_instance.dc (remote-exec):   Password: true
aws_instance.dc (remote-exec):   HTTPS: false
aws_instance.dc (remote-exec):   Insecure: false
aws_instance.dc (remote-exec):   NTLM: false
aws_instance.dc (remote-exec):   CACert: false
aws_instance.dc: Still creating... [5m0s elapsed]
aws_instance.wef: Still creating... [4m40s elapsed]
aws_instance.dc: Still creating... [5m10s elapsed]
aws_instance.wef: Still creating... [4m50s elapsed]

aws_instance.wef (remote-exec): Connecting to remote host via WinRM...
aws_instance.wef (remote-exec):   Host: 52.53.127.45
aws_instance.wef (remote-exec):   Port: 5985
aws_instance.wef (remote-exec):   User: vagrant
aws_instance.wef (remote-exec):   Password: true
aws_instance.wef (remote-exec):   HTTPS: false
aws_instance.wef (remote-exec):   Insecure: false
aws_instance.wef (remote-exec):   NTLM: false
aws_instance.wef (remote-exec):   CACert: false
aws_instance.wef: Still creating... [5m0s elapsed]
aws_instance.wef: Still creating... [5m10s elapsed]


Error: timeout - last error: unknown error Post "http://52.53.127.45:5985/wsman": dial tcp 52.53.127.45:5985: i/o timeout



Error: timeout - last error: dial tcp 3.101.130.214:22: i/o timeout



Error: timeout - last error: unknown error Post "http://54.193.103.250:5985/wsman": dial tcp 54.193.103.250:5985: i/o timeout



Error: timeout - last error: unknown error Post "http://52.53.190.108:5985/wsman": dial tcp 52.53.190.108:5985: i/o timeout

